## Introduction to SQL and Advanced Functions | Assignment

### Q1. Explain the fundamental differences between DDL, DML, and DQL commands in SQL. Provide one example for each type of command.

#### A1. 1. DDL – Data Definition Language DDL commands define and manage the structure of database objects like tables, indexes, and schemas. They affect the schema, not the actual data. Common commands:

#### CREATE – Create database objects.
#### ALTER – Modify existing objects.
#### DROP – Delete objects.
#### TRUNCATE – Remove all data but keep structure

#### example:
#### CREATE TABLE Employees (EmployeeID INT PRIMARY KEY,FirstName VARCHAR(50),LastName VARCHAR(50));

#### 2. DML – Data Manipulation Language DML commands manipulate the actual data stored in tables. They work within the structure defined by DDL. Common commands:

#### INSERT – Add new records.
#### UPDATE – Modify existing records.
#### DELETE – Remove records. 

#### example: 
#### INSERT INTO Employees (FirstName, LastName) VALUES ('John', 'Doe');

#### 3.  DCL – Data Control Language DCL commands control access to data by granting or revoking permissions. They are crucial for database security. Common commands:

#### GRANT – Give privileges to users.
#### REVOKE – Remove privileges from users. 
#### Example:

#### GRANT SELECT, UPDATE ON Employees TO user_name;

### Q2.  What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful.

#### A2.  SQL constraints are rules applied to columns or tables in a relational database to limit the type of data that can be inserted, updated, or deleted. These rules ensure the data is valid, consistent, and adheres to the business logic or database requirements. Constraints can be enforced during table creation or later using the ALTER TABLE statement. They play a vital role in maintaining the quality and integrity of your database.

#### 1. NOT NULL Constraint: Ensures a column cannot have NULL values. Example: ID int NOT NULL to ensure every record has a unique ID. 
#### 2. UNIQUE Constraint: Ensures all values in a column are unique. Example: ID int UNIQUE to prevent duplicate IDs. 
#### 3. PRIMARY KEY Constraint: Ensures a column or combination of columns uniquely identifies each row in a table. Example: ID int PRIMARY KEY to ensure each user has a unique ID.

### Q3.   Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?

#### A3. The LIMIT clause specifies the maximum number of rows to return in your query result. 
#### The OFFSET clause specifies how many rows to skip before starting to return rows.
#### Retrieve the third page of results (page size = 10):
#### page_number = 3
#### page_size = 10
#### OFFSET = (3 - 1) * 10 = 20
#### LIMIT = 10

#### SQL QUERY 

#### SELECT * FROM employees
#### ORDER BY employee_id
#### LIMIT 10 OFFSET 20;
#### This query skips the first 20 rows (pages 1 and 2) and retrieves the next 10 rows, which correspond to page 3.

### Q4. What is a Common Table Expression (CTE) in SQL, and what are its main benefits? Provide a simple SQL example demonstrating its usage.

#### A4. A common table expression (CTE) is a temporary result set defined within a SQL query that can be referenced by the main query or even recursively within itself. CTEs provide a way to structure queries for improved readability, making them a go-to tool for handling complex queries.

#### Uses of CTEs
#### 1. Breaking down complex queries into smaller, reusable components.
#### 2. Improving readability and modularity by separating the logic.
#### 3. Enabling recursive operations for hierarchical data.

#### Syntax

#### WITH cte_name AS (
 ####    SELECT query
#### )
#### SELECT * FROM cte_name;

#### example: In this example, we will use a Common Table Expression (CTE) to calculate the average salary for each department in the Employees table. The CTE simplifies the query by breaking it into a manageable part that can be referenced in the main query.

#### WITH AvgSalaryByDept AS (SELECT Department, AVG(Salary) AS AvgSalary FROM Employees GROUP BY Department)
#### SELECT * FROM AvgSalaryByDept;

### Q5.  Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).

#### A5. Normalization in DBMS Normalization is an essential part of your database in DBMS. It is the first intelligent design of the schema that organizes data systematically. In this case, data is essentially your foundation to an efficient, reliable, scalable and flexible database. What normalization basically does is ensure that your data is free of data redundancy or duplicate data and does not have data anomalies that would otherwise compromise its integrity.

#### 1. First Normal Form (1NF): In the 1NF stage, each column in a table is unique, with no repetition of groups of data. Here, each entry (or tuple) has a unique identifier known as a primary key.
#### 2. Second Normal Form (2NF): Building upon 1NF, at this stage, all non-key attributes are fully functionally dependent on the primary key. In other words, the non-key columns in the table should rely entirely on each candidate key.
#### 3. Third Normal Form (3NF): This stage takes care of transitive functional dependencies. In the 3NF stage, every non-principal column should be non-transitively dependent on each key within the table.

### Q6.  Create a database named ECommerceDB and perform the following tasks:

In [4]:
#A6.
import sqlite3
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create Tables
cursor.execute("""
CREATE TABLE Categories (
    CategoryID INTEGER PRIMARY KEY,
    CategoryName TEXT NOT NULL UNIQUE
);
""")

cursor.execute("""
CREATE TABLE Products (
    ProductID INTEGER PRIMARY KEY,
    ProductName TEXT NOT NULL UNIQUE,
    CategoryID INTEGER,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INTEGER,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);
""")

cursor.execute("""
CREATE TABLE Customers (
    CustomerID INTEGER PRIMARY KEY,
    CustomerName TEXT NOT NULL,
    Email TEXT UNIQUE,
    JoinDate DATE
);
""")

cursor.execute("""
CREATE TABLE Orders (
    OrderID INTEGER PRIMARY KEY,
    CustomerID INTEGER,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
""")

# Insert Records
cursor.executemany("INSERT INTO Categories VALUES (?,?)", [
    (1, 'Electronics'),
    (2, 'Books'),
    (3, 'Home Goods'),
    (4, 'Apparel')
])

cursor.executemany("INSERT INTO Products VALUES (?,?,?,?,?)", [
    (101, 'Laptop Pro', 1, 1200.00, 50),
    (102, 'SQL Handbook', 2, 45.50, 200),
    (103, 'Smart Speaker', 1, 99.99, 150),
    (104, 'Coffee Maker', 3, 75.00, 80),
    (105, 'Novel: The Great SQL', 2, 25.00, 120),
    (106, 'Wireless Earbuds', 1, 150.00, 100),
    (107, 'Blender X', 3, 120.00, 60),
    (108, 'T-Shirt Casual', 4, 20.00, 300)
])

cursor.executemany("INSERT INTO Customers VALUES (?,?,?,?)", [
    (1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
    (2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
    (3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
    (4, 'Diana Prince', 'diana@example.com', '2021-04-26')
])

cursor.executemany("INSERT INTO Orders VALUES (?,?,?,?)", [
    (1001, 1, '2023-04-26', 1245.50),
    (1002, 2, '2023-10-12', 99.99),
    (1003, 1, '2023-07-01', 145.00),
    (1004, 3, '2023-01-14', 150.00),
    (1005, 2, '2023-09-24', 120.00),
    (1006, 1, '2023-06-19', 20.00)
])

conn.commit()
print("Database and Tables Created Successfully with Records!")

Database and Tables Created Successfully with Records!

### Q7. Generate a report showing CustomerName, Email, and the TotalNumberofOrders for each customer. Include customers who have not placed any orders, in which case their TotalNumberofOrders should be 0. Order the results by CustomerName.

In [5]:
#A7. 
query = """
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberofOrders
FROM Customers c
LEFT JOIN Orders o ON c.CustomerID = o.CustomerID
GROUP BY c.CustomerID
ORDER BY c.CustomerName;
"""
for row in cursor.execute(query):
    print(row)

('Alice Wonderland', 'alice@example.com', 3)
('Bob the Builder', 'bob@example.com', 2)
('Charlie Chaplin', 'charlie@example.com', 1)
('Diana Prince', 'diana@example.com', 0)

### Q8. Retrieve Product Information with Category: Write a SQL query to display the ProductName, Price, StockQuantity, and CategoryName for all products. Order the results by CategoryName and then ProductName alphabetically.

In [6]:
#A8.
query = """
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM Products p
JOIN Categories c ON p.CategoryID = c.CategoryID
ORDER BY c.CategoryName, p.ProductName;
"""
for row in cursor.execute(query):
    print(row)

('T-Shirt Casual', 20, 300, 'Apparel')
('Novel: The Great SQL', 25, 120, 'Books')
('SQL Handbook', 45.5, 200, 'Books')
('Laptop Pro', 1200, 50, 'Electronics')
('Smart Speaker', 99.99, 150, 'Electronics')
('Wireless Earbuds', 150, 100, 'Electronics')
('Blender X', 120, 60, 'Home Goods')
('Coffee Maker', 75, 80, 'Home Goods')

### Q9. Write a SQL query that uses a Common Table Expression (CTE) and a Window Function (specifically ROW_NUMBER() or RANK()) to display the CategoryName, ProductName, and Price for the top 2 most expensive products in each CategoryName.

In [7]:
#A9. 
query = """
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) AS rn
    FROM Products p
    JOIN Categories c ON p.CategoryID = c.CategoryID
)
SELECT CategoryName, ProductName, Price
FROM RankedProducts
WHERE rn <= 2;
"""
for row in cursor.execute(query):
    print(row)

('Apparel', 'T-Shirt Casual', 20)
('Books', 'SQL Handbook', 45.5)
('Books', 'Novel: The Great SQL', 25)
('Electronics', 'Laptop Pro', 1200)
('Electronics', 'Wireless Earbuds', 150)
('Home Goods', 'Blender X', 120)
('Home Goods', 'Coffee Maker', 75)

### Q10.  You are hired as a data analyst by Sakila Video Rentals, a global movie rental company. The management team is looking to improve decision-making by analyzing existing customer, rental, and inventory data. Using the Sakila database, answer the following business questions to support key strategic initiatives. 
### Tasks & Questions:

#### A10 (Sample SQL Queries):

#### 1️. Top 5 customers by spending:

#### SELECT c.first_name, c.last_name, c.email, SUM(p.amount) AS TotalSpent

#### FROM payment p

#### JOIN customer c ON p.customer_id = c.customer_id

#### GROUP BY c.customer_id

#### ORDER BY TotalSpent DESC

#### LIMIT 5;

#### 2️. Top 3 movie categories by rental counts:

#### SELECT cat.name AS CategoryName, COUNT(r.rental_id) AS RentalCount

#### FROM rental r

#### JOIN inventory i ON r.inventory_id = i.inventory_id

#### JOIN film_category fc ON i.film_id = fc.film_id

#### JOIN category cat ON fc.category_id = cat.category_id

#### GROUP BY cat.name

#### ORDER BY RentalCount DESC

#### LIMIT 3;

#### 3️. Films available per store & never rented:

#### SELECT s.store_id, COUNT(i.inventory_id) AS TotalFilms, SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRented

#### FROM inventory i

#### LEFT JOIN rental r ON i.inventory_id = r.inventory_id

#### JOIN store s ON i.store_id = s.store_id

#### GROUP BY s.store_id;

#### 4️. Monthly revenue for 2023:

#### SELECT strftime('%Y-%m', payment_date) AS Month, SUM(amount) AS Revenue

#### FROM payment

#### WHERE strftime('%Y', payment_date) = '2023'

#### GROUP BY Month

#### ORDER BY Month;

#### 5️. Customers with >10 rentals in last 6 months:

#### SELECT c.first_name, c.last_name, COUNT(r.rental_id) AS Rentals

#### FROM rental r

#### JOIN customer c ON r.customer_id = c.customer_id

#### WHERE r.rental_date >= DATE('now', '-6 months')

#### GROUP BY c.customer_id

#### HAVING COUNT(r.rental_id) > 10;